[
  {
    "id" : "Labrador Retriever",
    "name" : "Labrador Retriever",
    "headline" : "The Labrador is a loyal companion, babysitter and best friend, so could well be the perfect family dog.",
    "description" : "The Labrador Retriever, or simply Labrador, is a British breed of retriever gun dog. It was developed in the United Kingdom from fishing dogs imported from the colony of Newfoundland (now a province of Canada), and was named after the Labrador region of that colony. It is among the most commonly kept dogs in several countries, particularly in the European world. The Labrador is friendly, energetic, and playful.[2] It was bred as a sporting and hunting dog but is widely kept as a companion dog. It may also be trained as a guide or assistance dog, or for rescue or therapy work. In the 1830s, the 10th Earl of Home and his nephews, the 5th Duke of Buccleuch and Lord John Scott, imported progenitors of the breed from Newfoundland to Europe for use as gun dogs. Another early advocate of these Newfoundland fishing dogs was the 2nd Earl of Malmesbury, who bred them for their expertise in waterfowling. During the 1880s, the 3rd Earl of Malmesbury, the 6th Duke of Buccleuch, and the 12th Earl of Home collaborated to develop and establish the Labrador Retriever breed. The dogs Buccleuch Avon and Buccleuch Ned, given by Malmesbury to Buccleuch, were mated with bitches carrying blood from those originally imported by the 5th Duke and the 10th Earl of Home. The offspring are the ancestors of all modern Labradors.",
    
    "link" : "https://en.wikipedia.org/wiki/Labrador_Retriever",
    "image" : "lion",
    "gallery" : [
      "lion-2",
      "lion-3",
      "lion-4",
      "lion-1"
    ],
    "fact" : [
      "1. Labradors have webbed toes and are therefore great swimmers. ...",                       "    2.Their coat has two layers: a short, thick topcoat and a relatively water-resistant undercoat. ... ",                                                                                         "  3. They are the most commonly used breed for guide dogs."
    ]
  },
  {
    "id" : "German Shepherd",
    "name" : "German Shepherd",
    "headline" : "German Shepherd Dogs consistently make the AKC's annual list of most popular breeds. And it's no wonder. Their loyalty, courage, confidence, ability to learn, and willingness to protect their people is like no other breed.",
    "description" : "During the 1890s, attempts were being made to standardise dog breeds. Dogs were being bred to preserve traits that assisted in their job of herding sheep and protecting their flocks from predators. In Germany this was practised within local communities, where shepherds selected and bred dogs. It was recognised that the breed had the necessary skills for herding sheep, such as intelligence, speed, strength and keen senses of smell. The results were dogs that were able to do such things, but that differed significantly, both in appearance and ability, from one locality to another.To combat these differences, the Phylax Society was formed in 1891 with the intention of creating standardised development plans for native dog breeds in Germany. The society disbanded after only three years due to ongoing internal conflicts regarding the traits in dogs that the society should promote;some members believed dogs should be bred solely for working purposes, while others believed dogs should be bred also for appearance. While unsuccessful in their goal, the Phylax Society had inspired people to pursue standardising dog breeds independently. With the rise of large, industrialised cities in Germany, the predator population began to decline, rendering sheepdogs unnecessary. At the same time, the awareness of sheepdogs as a versatile, intelligent class of canine began to rise. Max von Stephanitz, an ex-cavalry captain and former student of the Berlin Veterinary College, was an ex-member of the Phylax Society who firmly believed dogs should be bred for working. He admired the intelligence, strength and ability of Germany's native sheepdogs, but could not find any one single breed that satisfied him as the perfect working dog. In 1899, von Stephanitz was attending a dog show when he was shown a dog named Hektor Linksrhein. Hektor was the product of few generations of selective breeding and completely fulfilled what von Stephanitz believed a working dog should be. He was pleased with the strength of the dog and was so taken by the animal's intelligence, loyalty, and beauty, that he purchased him immediately. After purchasing the dog he changed his name to Horand von Grafrath and von Stephanitz founded the Verein für Deutsche Schäferhunde (Society for German Shepherd Dogs). Horand was declared to be the first German Shepherd Dog, and was the first dog added to the society's breed register. In just a few decades of the Verein für Deutsche Schäferhunde's establishment, the breed became one of the world's most popular and numerous, a position it has maintained to this day. By 1923, the Verein für Deutsche Schäferhunde claimed 50,000 dues-paying members in more than 500 branches in Germany alone. Horand became the center-point of the breeding programs and was bred with dogs belonging to other society members that displayed desirable traits and with dogs from Thuringia, Franconia, and Württemberg. Fathering many pups, Horand's most prolific was Hektor von Schwaben. Hektor was inbred with another of Horand's offspring and produced Heinz von Starkenburg, Beowulf, and Pilot, who later sired a total of 84 pups, mostly through being inbred with Hektor's other offspring. This inbreeding was deemed necessary in order to fix the traits being sought in the breed.Beowulf's progeny also were inbred and it is from these pups that all German Shepherds draw a genetic link. It is believed the society accomplished its goal mostly due to von Stephanitz's strong, uncompromising leadership and he is therefore credited with being the creator of the German Shepherd Dog. During the first half of the twentieth century, the breed came to be strongly identified with Imperial and Nazi Germany, because of its association with purity and militarism. German Shepherds were coveted as 'germanische Urhunde', being close to the wolf, and became very fashionable during the Nazi era. Adolf Hitler acquired a German Shepherd named 'Prinz' in 1921, during his years of poverty, but he had been forced to lodge the dog elsewhere. However, she managed to escape and return to him. Hitler, who adored the loyalty and obedience of the dog, thereafter developed a great liking for the breed. Hitler kept several more of the breed, including Blondi, who was among several dogs in the 'Führerbunker' during the Battle of Berlin at the end of the Second World War. Dogs played a role in Nazi propaganda by portraying Hitler as an animal lover. Preparing for his suicide, Hitler ordered Dr. Werner Haase to test a cyanide capsule on Blondi, and the dog died as a result. Erna Flegel, a nurse who worked at the emergency casualty station in the Reich Chancellery stated in 2005 that Blondi's death had affected the people in the bunker more than Eva Braun's suicide. German Shepherds were also used widely as guard dogs at Nazi concentration camps during the Holocaust. When the German Shepherd was introduced to the United States it was initially a popular dog. But as the dogs' popularity grew, it became associated as a dangerous breed owned by gangsters and bootleggers. The reputation of the German Shepherds as a dangerous breed had grown to such an extent that it was briefly banned to import them in Australia in 1929.Potential legislation was even considered to require that all German shepherds in South Australia be sterilised.",
    "link" : "https://en.wikipedia.org/wiki/German_Shepherd",
    "image" : "zebra",
    "gallery" : [
      "zebra-3",
      "zebra-4",
      "zebra-2",
      "zebra-1"
    ],
    "fact" : [
      "Fact #1: German Shepherds Are One of The Smartest Dog Breeds.",                                               " Fact #2: World War I Made Shepherds Famous.",                                                                " Fact #3: German Shepherds Aren't Dangerous Dogs.   ",                                                      " Fact #4: The First Modern German Shepherds.Fact #5: German Shepherds Remain Hugely Popular in America.",
     
    ]
  },
  {
    "id" : "Golden Retriever",
    "name" : "Golden Retriever",
    "headline" : "Goldens are outgoing, trustworthy, and eager-to-please family dogs, and relatively easy to train. They take a joyous and playful approach to life and maintain this puppyish behavior into adulthood. These energetic, powerful gundogs enjoy outdoor play..",
    "description" : "The Golden Retriever is a Scottish breed of retriever dog of medium size. It is characterised by a gentle and affectionate nature and a striking golden coat. It is commonly kept as a pet and is among the most frequently registered breeds in several Western countries. It is a frequent competitor in dog shows and obedience trials; it is also used as a gundog, and may be trained for use as a guide dog.  The breed was created by Sir Dudley Marjoribanks at his Scottish estate Guisachan in the late nineteenth century. He cross-bred Flat-coated Retrievers with Tweed Water Spaniels, with some further infusions of Red Setter, Labrador Retriever and Bloodhound. The breed was recognised by the Kennel Club in 1913, and during the interwar period spread to many parts of the world.                                                    History:-                                                                                                         Nous, sitting, at Guisachan, 1870s, The Golden Retriever was developed in Scotland in the nineteenth century by Sir Dudley Marjoribanks (later to become Baron Tweedmouth) from Flat-coated Retrievers judiciously crossed with Tweed Water Spaniels and some other British dog breeds. Prior to the 1952 publication of the very detailed stud book which had been meticulously maintained by Marjoribanks, a number of romantic tales were published about the origins of the breed.In the 1860s Marjoribanks set out to create what to his mind was the ultimate breed of retriever at his Scottish estate Guisachan. He started by acquiring a yellow-coloured Flat-coated Retriever dog called Nous; Nous had been whelped in June 1864 and was the only yellow pup in an otherwise all black-coloured litter. Whilst uncommon, occasionally liver, brown, golden or yellow-coloured purebred Flat-coated Retriever pups are whelped to matings of two black parents. It is the pedigree of Nous that was the source for the romantic tales of the heritage of the Golden Retriever. One early account claimed Nous was purchased from a Russian circus trainer in Brighton, another claimed he was bought from a cobbler, and yet another claimed a gypsy. The stud book states that Nous was a Flat-coated Retriever bred by Lord Chichester on his Stanmer Park estate near Brighton.  In 1868 Nous was mated to a Tweed Water Spaniel bitch named Belle, who is recorded in the stud book as being whelped in 1863 and being of 'Ladykirk breeding'. The litter from this mating consisted of four yellow pups, Primrose, Ada, Cowslip and Crocus. The best bitch from this litter, Cowslip, was mated to a Tweed Water Spaniel called Tweed with the mating producing a bitch pup called Topsy. Cowslip was subsequently mated to a Red Setter called Sampson; that mating produced a dog pup called Jack. Topsy was mated with a black Flat-coated Retriever called Sambo and a bitch pup from that litter, Zoe, was mated back to Jack and two pups from that mating were retained, a dog called Nous II and a bitch called Gill. Gill was mated to a black Labrador Retriever called Tracer, and a bitch pup from that mating, Queenie, was mated back to Nous II; all Golden Retrievers descend from this mating. The progeny from these various matings varied in colour from pure black to light cream, but it was the golden-coloured ones that were retained and mated to each other, forming the foundation stock of the Golden Retriever breed. Marjoribanks is also known to have used a sandy-coloured Bloodhound and another Labrador in subsequent years of the breeding programme.",
    "link" : "https://en.wikipedia.org/wiki/Golden_Retriever",
    "image" : "rhinoceros-2",
    "gallery" : [
      "rhinoceros-3",
      "rhinoceros-4",
      "rhino",
      "rhinoceros-1"
    ],
    "fact" : [
      "Golden Retrievers are used for everything from hunting to rescue and service dog work. Despite that playful, sometimes goofy demeanor, they learn quickly and can master a multitude of skills, including how to perform as search and rescue dogs at the site of a disaster.",                                              " 1. Golden Retrievers originated in Scotland. ...                                                          2. They only live up to 12 years. ...                                                                     3. Goldens are the gold-star choice for family dogs. ...                                                  4. They are easy to train. ...                                                                          5. Golden Retrievers come in three officially recognized colors."
    ]
  },
  {
    "id" : "Bulldog",
    "name" : "Bulldog",
    "headline" : "Bulldog is a thick-set, low-slung, well-muscled bruiser whose 'sourmug' face is the universal symbol of courage and tenacity. These docile, loyal companions adapt well to town or country. You can't mistake a Bulldog for any other breed..",
    "description" : "The Bulldog is a British breed of dog of mastiff type. It may also be known as the English Bulldog or British Bulldog. It is a medium-sized, muscular dog of around 40–55 lb (18–25 kg). They have large heads with thick folds of skin around the face and shoulders, and a relatively flat face with a protruding lower jaw. The breed has significant health issues as a consequence of breeding for its distinctive appearance, including brachycephalia, hip dysplasia, heat sensitivity, and skin infections. Due to concerns about their quality of life, breeding Bulldogs is illegal in Norway and the Netherlands.The modern Bulldog was bred as a companion dog from the Old English Bulldog, a now-extinct breed used for bull-baiting, when the sport was outlawed in England under the Cruelty to Animals Act. The Bulldog Club (In England) was formed in 1878, and the Bulldog Club of America was formed in 1890. While often used as a symbol of ferocity and courage, modern Bulldogs are generally friendly, amiable dogs. Bulldogs are now commonly kept as pets; in 2013 it was in twelfth place on a list of the breeds most frequently registered worldwide.                                                                                             History:-                                                                                                    Painting of a Bulldog from 1790 by English artist Philip Reinagle.The first reference to the word 'Bulldog' is dated 1631 or 1632 in a letter by a man named Preswick Eaton where he writes: 'procuer mee two good Bulldogs, and let them be sent by ye first shipp'.In 1666, English scientist Christopher Merret applied: 'Canis pugnax, a Butchers Bull or Bear Dog', as an entry in his Pinax Rerum Naturalium Britannicarum.                                                                                              The designation 'bull' was applied because of the dog's use in the sport of bull-baiting. This entailed the setting of dogs (after placing wagers on each dog) onto a tethered bull. The dog that grabbed the bull by the nose and pinned it to the ground would be the victor. It was common for a bull to maim or kill several dogs at such an event, either by goring, tossing, or trampling over them. Over the centuries, dogs used for bull-baiting developed the stocky bodies and massive heads and jaws that typify the breed, as well as a ferocious and savage temperament. Bull-baiting was made illegal in England by the Cruelty to Animals Act 1835. Therefore, the Old English Bulldog had outlived its usefulness in England as a sporting animal and its 'working' days were numbered. However, emigrants did have a use for such dogs in the New World. In mid-17th century New York, Bulldogs were used as a part of a citywide roundup effort led by Governor Richard Nicolls. Because cornering and leading wild bulls was dangerous, Bulldogs were trained to seize a bull by its nose long enough for a rope to be secured around its neck.                                                                                                                                                Bulldogs as pets were continually promoted by dog dealer Bill George.                                                                                                                                                  In 1864, a group of Bulldog breeders under R. S. Rockstro founded the first Bulldog Club. Three years after its opening the Club ceased to exist, not having organized a single show. The main achievement of the Rockstro Bulldog Club was a detailed description of the Bulldog, known as the Philo-Kuan Standard. Samuel Wickens, treasurer of the club, published this description in 1865 under the pseudonym Philo-Kuan.                                                                                                                    On 4 April 1873, The Kennel Club was founded, the first dog breeding club dealing with the registration of purebred dogs and dog breeds.[11] Bulldogs were included in the first volume of the Kennel Club Stud Book, which was presented at the Birmingham Show on 1 December 1874. The first English Bulldog entered into the register was a male dog named Adam (Adamo), born in 1864.Bulldog from 1915.In March 1875, the third Bulldog Club was founded, which still exists today.[13][14] Members of this club met frequently at the Blue Post pub on Oxford Street in London. The founders of the club collected all available information about the breed and its best representatives and developed a new standard for the English Bulldog, which was published on 27 May 1875, the same year they held the first breed show. Since 1878, exhibitions of the club were held annually, except during the Second World War. On 17 May 1894, the Bulldog Club was granted the status of a corporation and since then has carried the official name 'The Bulldog Club, Inc.'. It is the oldest mono-breed dog kennel club in the world.The Bulldog was officially recognized by the American Kennel Club in 1886.In 1894 the two top Bulldogs, King Orry and Dock Leaf, competed in a contest to see which dog could walk 20 miles (32 km). King Orry was reminiscent of the original Bulldogs, lighter boned and very athletic. Dock Leaf was smaller and heavier set, more like modern Bulldogs. King Orry was declared the winner that year, finishing the 20-mile (32 km) walk while Dock Leaf collapsed and expired.[17] Though today Bulldogs look tough, they cannot perform the job they were originally bred for, as they cannot withstand the rigors of running after and being thrown by a bull, and also cannot grip with such a short muzzle. Although not as physically capable as their ancestors, modern Bulldogs are much calmer and less aggressive..",
    "link" : "https://en.wikipedia.org/wiki/Bulldog",
    "image" : "elephant",
    "gallery" : [
      "elephant-2",
      "elephant-1",
      "elephant-3",
      "elephant-4"
    ],
    "fact" : [
        "Bulldog is a thick-set, low-slung, well-muscled bruiser whose 'sourmug' face is the universal symbol of courage and tenacity. These docile, loyal companions adapt well to town or country. You can't mistake a Bulldog for any other breed.",
      "They Get Their Name From the Sport of Bullbaiting...                                                     They Aren't Great Swimmers. ...",
      "The Breed Almost Became Extinct. ...                                                                      The Bulldog Is the Most Popular Dog Mascot ",
      "They Were Known As “The Churchill Dog...                                                                  Many Celebrities Have Owned Bulldogs. ..",
      "Two Presidents Have Owned Bulldogs. ..."
    ]
  },
  {
    "id" : "St. Bernard",
    "name" : "St. Bernard",
    "headline" : "Saint Bernard Dog Breed Information and Personality Traits. Known to be loving, gentle and tolerant in spite of its size, Saint Bernards are a good with families with well-behaved children. In addition, they are eager to please, making training easier.",
    "description" : "The St. Bernard or Saint Bernard (UK: /ˈbɜːrnərd/, US: /bərˈnɑːrd/) is a breed of very large working dog from the Western Alps in Italy and Switzerland. They were originally bred for rescue work by the hospice of the Great St Bernard Pass on the Italian-Swiss border. The hospice, built by and named after the Alpine monk Saint Bernard of Menthon, acquired its first dogs between 1660 and 1670. The breed has become famous through tales of Alpine rescues, as well as for its large size, and gentle temperament. The earliest written records of the St. Bernard are from monks at the Great St Bernard Hospice at the Great St Bernard Pass in 1707, with paintings and drawings of the dog dating even earlier.Early British accounts of the breed described the breed as the Alpine Spaniel. The first evidence that the dogs were in use at the monastery is in two paintings dating to 1690 by Italian artist Salvator Rosa. The most famous St. Bernard to save people at the pass was Barry (sometimes spelled Berry), who reportedly saved somewhere between 40 and 100 lives. There is a monument to Barry in the Cimetière des Chiens, and his body was preserved in the Natural History Museum in Bern.Another famous dog was Rutor, the faithful companion of the Italian priest Pierre Chanoux, who was named after the peak Tête du Rutor located above the Little St. Bernard pass. The classic St. Bernard looked very different from the St. Bernard of today because of crossbreeding. Severe winters from 1816 to 1818 led to increased numbers of avalanches, killing many of the dogs used for breeding while they were performing rescues. In an attempt to preserve the breed, the remaining St. Bernards were crossed with Newfoundlands brought from the Colony of Newfoundland in the 1850s, as well as with other breeds, and so lost much of their use as rescue dogs in the snowy climate of the Alps because the long fur they inherited would freeze and weigh them down. The dogs never received any special training from the monks. Instead, younger dogs would learn how to perform search and rescue operations from older dogs.The Swiss St. Bernard Club was founded in Basel on 15 March 1884. The St. Bernard was the first breed entered into the Swiss Stud Book in 1884, and the breed standard was finally approved in 1888. Since then, the breed has been a Swiss national dog.During World War I St. Bernard dogs assisted the Red Cross and were used to carry supplies to troops in the Italian mountains, stationed in places inaccessible to mules and horses.The dogs at the Great St Bernard Hospice were working dogs that were smaller than today's show St. Bernards. Originally about the size of a German Shepherd Dog, the St. Bernard grew to the size of today's dog as kennel clubs and dog shows emphasized appearance over the dog's working ability, along with a closed stud book.An open stud book would have allowed breeders to correct such errors by breeding in working dogs of other dog breeds.",
    "link" : "https://en.wikipedia.org/wiki/St._Bernard_(dog)",
    "image" : "cheetah",
    "gallery" : [
      "cheetah-3",
      "cheetah-1",
      "cheetah-2",
      "cheetah-4"
    ],
    "fact" : [
        "They are Switzerland's national dog.",
        "The name Saint Bernard – or St Bernard – was not adopted until 1888...",
  "If you choose to buy a Saint Bernard from a breeder, you can expect to pay around $1000-$1500. With reputable breeders, the price of a Saint Bernard puppy can be as high as $2500.",
      "They don't do well in the heat – but their warm and water repellent coats are great for the snow and ice."
    ]
  },
  {
    "id" : "Siberian Husky",
    "name" : "Siberian Husky",
    "headline" : "Huskies are generally considered to be good family pets. However, it's worth noting that these are extremely active dogs and will fit in best with busy families who are out and about a lot.",
    "description" : "The Siberian Husky is a medium-sized working sled dog breed. The breed belongs to the Spitz genetic family. It is recognizable by its thickly furred double coat, erect triangular ears, and distinctive markings, and is smaller than the similar-looking Alaskan Malamute.Siberian Huskies originated in Northeast Asia where they are bred by the Chukchi people of Siberia for sled pulling, and companionship.It is an active, energetic, resilient breed, whose ancestors lived in the extremely cold and harsh environment of the Siberian Arctic. William Goosak, a Russian fur trader, introduced them to Nome, Alaska, during the Nome Gold Rush, initially as sled dogs to work the mining fields and for expeditions through otherwise impassable terrain.[2] Today, the Siberian Husky is typically kept as a house pet, though they are still frequently used as sled dogs by competitive and recreational mushersThe American Kennel Club describes the Siberian Husky's eyes as 'an almond shape, moderately spaced and set slightly obliquely.' The AKC breed standard is that eyes may be brown, blue or black; one of each or particoloured are acceptable (complete is heterochromia). These eye-color combinations are considered acceptable by the American Kennel Club. The parti-color does not affect the vision of the dog.Show-quality dogs are preferred to have neither pointed nor square noses. The nose is black in gray dogs, tan in black dogs, liver in copper-colored dogs, and may be light tan in white dogs. In some instances, Siberian Huskies can exhibit what is called 'snow nose' or 'winter nose.' This condition is called hypopigmentation in animals. 'Snow nose' is acceptable in the show ringSiberian Husky tails are heavily furred; these dogs will often curl up with their tails over their faces and noses in order to provide additional warmth. When curled up to sleep the Siberian Husky will cover its nose for warmth, often referred to as the 'Siberian Swirl'. The tail should be expressive, held low when the dog is relaxed, and curved upward in a 'sickle' shape when excited or interested in something..",
    "link" : "https://en.wikipedia.org/wiki/Siberian_Husky",
    "image" : "giraffe",
    "gallery" : [
      "giraffe-1",
      "giraffe-2",
      "giraffe-3",
      "giraffe-4"
    ],
    "fact" : [
      "Siberian Husky, a thickly coated, compact sled dog of medium size and great endurance, was developed to work in packs, pulling light loads at moderate speeds over vast frozen expanses. Sibes are friendly, fastidious, and dignified.",
      "iberian huskies are probably best-known for their incredible sled-pulling skills, but these doggies aren't all business! Indeed, they make excellent working dogs, as they were bred originally to help the Chukchi people of Siberia hunt more efficiently. But they're sweet, friendly, and loyal cuddle bugs, too.",
      "Huskies were developed as working sled dogs over thousands of years by the Chukchi people living in the Siberian peninsula of northeast Asia. ...",
      "Two Huskies guard the gates of heaven. ...",
      "Siberian sled dogs were used by the U.S. Army during World War II for Arctic search and rescue of downed pilots and cargo.",
    ]
  },
  {
    "id" : "Rottweiler",
    "name" : "Rottweiler",
    "headline" : "Rottweilers are people dogs and are affectionate and loyal toward their families. They are great family members and are excellent guard dogs for families as well. They tend to follow their favorite person from room to room, so they are always within their eyesight.",
    "description" : "According to the FCI Standard, the Rottweiler is considered to be one of the oldest surviving dog breeds. Its origin goes back to Roman times. These dogs were kept as herder or driving dogs. They marched over the Alps with the Roman legions, protecting the humans and driving their cattle. In the region of Rottweil, these dogs met and mixed with the native dogs in a natural crossing. The main task of the Rottweiler now became the driving and guarding of the herds of cattle and the defence of their masters and their property. This breed acquired its name from the old free city of Rottweil and was known as the 'Rottweil butcher's dog'. The butchers bred this type of dog purely for performance and usefulness. In due course, a first rate watch and driving dog evolved which could also be used as a draught dog.                   The buildup to World War I saw a great demand for police dogs, which led to a revival of interest in the Rottweiler. During the First and Second World Wars, Rottweilers saw service in various roles, including as messenger, ambulance, draught, and guard dogs.                                                        The Deutscher Rottweiler-Klub (DRK, German Rottweiler Club), the first Rottweiler club in Germany, was founded on 13 January 1914, and followed by the creation of the Süddeutscher Rottweiler-Klub (SDRK, South German Rottweiler Club) on 27 April 1915 and eventually became the IRK (International Rottweiler Club). The DRK counted around 500 Rottweilers, and the SDRK 3,000 Rottweilers. The goals of the two clubs were different. The DRK aimed to produce working dogs and did not emphasise the morphology of the Rottweiler.    The various German Rottweiler Clubs amalgamated to form the Allgemeiner Deutscher Rottweiler Klub (ADRK, General German Rottweiler Club) in 1921. This was officially recorded in the register of clubs and associations at the district court of Stuttgart on 27 January 1924.[9] The ADRK is recognised worldwide as the home club of the Rottweiler.                                                                            In 1931, the Rottweiler was officially recognised by the American Kennel Club.[11] In 1936, Rottweilers were exhibited in Britain at Crufts. In 1966, a separate register was opened for the breed. In fact, in the mid-1990s, the popularity of the Rottweiler reached an all-time high, as it was the most registered dog by the American Kennel Club.[12] In 2017, the American Kennel Club ranked the Rottweiler as the eighth-most popular purebred dog in the United States.       The various standards in place for the Rottweiler's physical appearance specify these characteristics.                                                                           1. Head (eyes)                                                                            2. Snout (teeth, tongue)                                                                                                             3. Dewlap (throat, neck skin)                                                                         4. Shoulder                                                                                                              5. Elbow                                                                         6. Forefeet                                                                                                             7.  Highest Point of the Rump                                                                        8.  Legs (thighs and hips)                                                                                                               9. Hock                                                                        10. Hind feetWithers                                                                                                             11. Stifle                                                                                                             12. Paws                                                                          13. Tail",
    "link" : "https://en.wikipedia.org/wiki/Rottweiler",
    "image" : "buffalo",
    "gallery" : [
      "buffalo-1",
      "buffalo-4",
      "buffalo-3",
      "buffalo-2"
    ],
    "fact" : [
        "The Rottweiler is a powerful breed of dog that is known for its strength and intelligence",
      "They are well known to be powerful, protective, and loyal, famous for their instinct for guarding. But Rottweilers are also easily trained, making them loyal, loving, and confident guardians.",
      "Rottweilers were bred to be guard dogs, and they are really good at it. They have a deep growl they use to alert their families to a potential threat, but they have an equally famous “rumble” sound they make when they are happy",
      "Rottweilers are blocky dogs with massive heads. Ears lie fairly tight to the head, hanging down somewhat. Muzzles are square and strong, but rottweilers can be a bit drooly because of loose flews (lips). Rottweilers should always be black with tan points, and the ideal coat is quite short, dense, and a bit harsh."
      
    ]
  },
  {
    "id" : "Pug",
    "name" : "Pug",
    "headline" : "The Pug is a breed of dog originally from China, with physically distinctive features of a wrinkly, short-muzzled face, and curled tail. ",
    "description" : "The Pug is a breed of dog originally from China, with physically distinctive features of a wrinkly, short-muzzled face, and curled tail. The breed has a fine, glossy coat that comes in a variety of colors, most often fawn (light brown) or black, and a compact, square body with well developed and thick muscles all over the body. Pugs were brought from China to Europe in the sixteenth century and were popularized in Western Europe by the House of Orange of the Netherlands, and the House of Stuart.In the United Kingdom, in the nineteenth century, Queen Victoria developed a passion for pugs which she passed on to other members of the Royal Family.Pugs are known for being sociable and gentle companion dogs. The American Kennel Club describes the breed's personality as 'even-tempered and charming'. Pugs remain popular into the twenty-first century, with some famous celebrity owners, despite facing various health problems due to their bred traits. While the pugs that are depicted in eighteenth century prints tend to be long and lean, modern breed preferences are for a square cobby body, a compact form, a deep chest, and well-developed muscle. Their smooth and glossy coats can be fawn, apricot fawn, silver fawn, or black. The markings are clearly defined and there is a trace of a black line extending from the occiput to the tail. The tail normally curls tightly over the hip.Pugs have two distinct shapes for their ears, rose and button. Rose ears are smaller than the standard style of  ears, and are folded with the front edge against the side of the head. Breeding preference goes to  style ears.Pugs' legs are strong, straight, of moderate length and are set well under. Their shoulders are moderately laid back. Their ankles are strong, their feet are small, their toes are well split-up, and their nails are black. The lower teeth normally protrude further than their upper, resulting in an under-bite.This breed is often described by the Latin phrase multum in parvo, or much in little or a lot of dog in a small space, alluding to the pug's remarkable and charming personality, despite its small size.Pugs are strong-willed but rarely aggressive, and are suitable for families with children. The majority of the breed is very fond of children and sturdy enough to properly play with them. Depending on their owner's mood, they can be quiet and docile but also vivacious and teasing. Pugs tend to be intuitive and sensitive to the moods of their owners and are usually eager to please them. Pugs are playful and thrive on human companionship. They also tend to have a snoozy nature and spend a lot of time napping. Pugs are often called shadows because they follow their owners around and like to stay close to the action,craving attention and affection from their owners.",
    "link" : "https://en.wikipedia.org/wiki/Pug",
    "image" : "hippo",
    "gallery" : [
      "hippo-3",
      "hippo-1",
      "hippo-4",
      "hippo-2"
    ],
    "fact" : [
      "The Pug has been bred to be a companion and a pleasure to his owners.",
      "Pugs live to please their people, so they are generally easy to train.",
      "They were bred to be lap dogs.",
      "They are meant to have wrinkles.",
      "They're very connected to royalty.",
      "They're one of the oldest dog breeds.",
      "They come in different colors.",
      "They were the symbol for a Secret Society.",
      "Napoleon's wife had a loyal pug.",
      "They're on the big screen."
    ]
  },
  {
    "id" : "wilddog",
    "name" : "Wild dog",
    "headline" : "Wild dogs are social and gather in packs of around ten individuals, but some packs number more than 40. They are opportunistic predators that hunt medium-sized ruminants, such as gazelles.",
    "description" : "The African wild dog, also called the painted wolf or Cape hunting dog, is a canine native to sub-Saharan Africa. It is the largest indigenous canine in Africa, and the only extant member of the genus Lycaon, which is distinguished from Canis by dentition highly specialised for a hypercarnivorous diet, and a lack of dewclaws. It is estimated that about 6,600 adults including 1,400 mature individuals live in 39 subpopulations that are all threatened by habitat fragmentation, human persecution and outbreaks of diseases. As the largest subpopulation probably consists of less than 250 individuals, the African wild dog is listed as endangered on the IUCN Red List since 1990.\n\nThe African wild dog is a highly social animal, living in packs with separate dominance hierarchies for males and females. Uniquely among social carnivores, the females rather than the males disperse from the natal pack once sexually mature. The young are allowed to feed first on carcasses. The species is a specialised diurnal hunter of antelopes, which it catches by chasing them to exhaustion. Like other canids, the African wild dog regurgitates food for its young, but this action is also extended to adults, to the point of being central to their social life. Its natural enemies are lions and hyenas: the former will kill the canids where possible whilst hyenas are frequent kleptoparasites.\n\nAlthough not as prominent in African folklore or culture as other African carnivores, it has been respected in several hunter-gatherer societies, particularly those of the predynastic Egyptians and the San people.\n\nThe African wild dog is the bulkiest and most solidly built of African canids.[31] The species stands 60 to 75 cm (24 to 30 in) in shoulder height, measures 71 to 112 cm (28 to 44 in) in head-and-body length and has a tail length of 29 to 41 cm (11 to 16 in). Body weight of adults range from 18 to 36 kg (40 to 79 lb). On average, dogs from East Africa weigh around 20–25 kg (44–55 lb) while in southern Africa, males reportedly weighed a mean of 32.7 kg (72 lb) and females a mean of 24.5 kg (54 lb). By body mass, they are only outsized amongst other extant canids by the grey wolf species complex.  Females are generally 3–7% smaller than males. \n\nCompared to members of the genus Canis, the African wild dog is comparatively lean and tall, with outsized ears and lacking dewclaws. The middle two toepads are usually fused. Its dentition also differs from that of Canis by the degeneration of the last lower molar, the narrowness of the canines and proportionately large premolars, which are the largest relative to body size of any carnivore other than hyenas.[36] The heel of the lower carnassial M1 is crested with a single, blade-like cusp, which enhances the shearing capacity of the teeth, thus the speed at which prey can be consumed. This feature, termed \"trenchant heel\", is shared with two other canids: the Asian dhole and the South American bush dog.[7] The skull is relatively shorter and broader than those of other canids.[31]",
    "link" : "https://en.wikipedia.org/wiki/African_wild_dog",
    "image" : "wild-dog",
    "gallery" : [
      "wild-dog-1",
      "wild-dog-2",
      "wild-dog-3",
      "wild-dog-4"
    ],
    "fact" : [
      "Unlike domestic dogs, wild dogs have long legs, four toes on their front feet and large, rounded ears. Though both species descended from wolves, they are unable to interbreed.",
      "Wild dogs live in tightly knit social groups of between two and 27 individuals. They are strongly bonded. They’ll even look after injured dogs, bringing them food until they recover.",
      "The wild dog’s short hair is in yellow, gray, white and black patches. No two dogs have the same markings and colorations, making it easy for conservationists to identify individuals."
    ]
  },
  {
    "id" : "Indian Spitz",
    "name" : "Indian Spitz",
    "headline" : "Everything you need to know about Indian Spitz dog- origin ...The Indian Spitz closely resembled foreign breeds and they were easy to get and relatively affordable. They are a part of the Spitz breed and are small, alert animals that make for excellent indoor guard dogs. Their appearance is similar to the German Sheperd but they have a smaller bone structure and a lot more fur.0",
    "description" : "The Indian Spitz was first introduced by the occupying British during the 19th century and thought to have descended from the German Spitz. After years of breeding, they were able to create a breed that could cope with the heat of Indian summers and retained the intelligence and adaptability of the German breed. Resembling a Samoyed and Pomeranian, the Indian Spitz was well-suited to the Indian climate and quickly became popular. The Indian Spitz became popular due to restrictive import rules imposed by the Indian Government in the 1980s and 1990s. Foreign imports were hard to access, and Indians turned to the indigenous and local breeds. The Indian Spitz is similar to the European Spitz, though it has adapted to a warmer climate. Indian Spitzes are small dogs - around 33 cm (13 in) at the withers - with a soft chest, fair tail, and a milky white double coat. Their eyes have visible irises that can be green or blue, giving them an unusually expressive face.  The original Spitz was bred for hunting in cold conditions, and their white coloring reflects this. Although the same conditions are not found in India, their coloring is attractive and has remained through the years. Some can be white and brown. Pointy fox-like ears make this breed especially expressive. Thick fur covers the outside of the ears and much of the inside as well, requiring extra attention when it comes to care and grooming. The tail of an Indian Spitz curls over their back and is quite fluffy. Their legs are only slightly longer than their bodies, which makes their heads look large. Indian Spitzes may be one of the easiest dogs to live with, making them one of the most popular family dog among Indian breeds. They are easily housebroken and trained. Grooming and exercise are relatively low maintenance, and they are highly adaptable dogs. They are equally comfortable in small apartments and in large, open houses. However, they do need moderate exercise. Generally Indian Spitzes are divided into two categories, the Smaller Indian Spitz or Lesser Indian Spitz (roughly 5-7 kg in weight and 22-25 cm at the withers), and the Bigger Indian Spitz or Greater Indian Spitz (roughly 12-20 kg in weight and 35-45 cm at the withers).  ",
    "link" : "https://en.wikipedia.org/wiki/Indian_Spitz",
    "image" : "meerkat",
    "gallery" : [
      "meerkat-1",
      "meerkat-2",
      "meerkat-3",
      "meerkat-4"
    ],
    "fact" : [
      "The Indian Spitz is one of the most friendly dogs you can find. Despite their hunting instincts (yes, they were bred to hunt), they love and get along well with children and other pets",
      "Their diet is also highly adaptable as per the conditions. They can survive on milk, yogurt and rice. If possible, the owner can also provide them a diet of chicken and rice",
      "The Indian Spitz is a breed that is friendly and loyal towards the members of the family.",
      "Cooking for an Indian Spitz is not that complicated; all you need to do is divide their meal into three parts: meat (or fish), rice, and veggies. In terms of exercise, they like to go on daily walks. They are utility dogs, which means they were bred to work or hunt.",
    ]
  },
  {
    "id" : "Beagle",
    "name" : "Beagle",
    "headline" : "The National Beagle Club of America says that Beagles are excellent family companions. Their low maintenance cost and their affectionate, yet independent, temperament make them an ideal pet for many families.",
    "description" : "The beagle is a breed of small scent hound, similar in appearance to the much larger foxhound. The beagle was developed primarily for hunting hare, known as beagling. Possessing a great sense of smell and superior tracking instincts, the beagle is the primary breed used as a detection dog for prohibited agricultural imports and foodstuffs in quarantine around the world. The beagle is intelligent and is a popular pet due to its size, good temper, and a lack of inherited health problems. The modern breed was developed in Great Britain around the 1830s from several breeds, including the Talbot Hound, the North Country Beagle, the Southern Hound, and possibly the Harrier.  Beagles have been depicted in popular culture since Elizabethan times in literature and paintings and more recently in film, television, and comic books.   Reverend Phillip Honeywood established a beagle pack in Essex in the 1830s and it is believed that this pack formed the basis for the modern breed. Although details of the pack's lineage are not recorded, it is thought that North Country Beagles and Southern Hounds were strongly represented; William Youatt suspected that Harriers formed a good majority of the beagle's bloodline, but the origin of the Harrier is itself obscure. Honeywood's Beagles were small, standing at about 10 inches (25 cm) at the shoulder, and pure white according to John Mills (writing in The Sportsman's Library in 1845). Prince Albert and Lord Winterton also had Beagle packs around this time, and royal favor no doubt led to some revival of interest in the breed, but Honeywood's pack was regarded as the finest of the three.Early images of the Beagle (clockwise from top left): 1833, 1835, Stonehenge's Medium (1859, reusing Youatt's 1852 'Beagle' image) and Dwarf Beagle (1859).Although credited with the development of the modern breed, Honeywood concentrated on producing dogs for hunting and it was left to Thomas Johnson to refine the breeding to produce dogs that were both attractive and capable hunters. Two strains were developed: the rough-coated and smooth-coated varieties. The rough-coated beagle survived until the beginning of the 20th century, and there were even records of one making an appearance at a dog show as late as 1969, but this variety is now extinct, having probably been absorbed into the standard beagle bloodline.In the 1840s, a standard beagle type was beginning to develop; the distinction between the North Country Beagle and Southern Hound had been lost, but there was still a large variation in size, character, and reliability among the emerging packs. In 1856, 'Stonehenge' (the pseudonym of John Henry Walsh), writing in the Manual of British Rural Sports, was still dividing beagles into four varieties: the medium beagle; the dwarf or lapdog beagle; the fox beagle (a smaller, slower version of the Foxhound); and the rough-coated or terrier beagle, which he classified as a cross between any of the other varieties and one of the Scottish terrier breeds. Stonehenge also gives the start of a standard description:          In size the beagle measures from 10 inches, or even less, to 15. In shape they resemble the old southern hound in miniature, but with more neatness and beauty; and they also resemble that hound in style of hunting.",
    "link" : "https://en.wikipedia.org/wiki/Beagle",
    "image" : "ostrich",
    "gallery" : [
      "ostrich-1",
      "ostrich-2",
      "ostrich-3",
      "ostrich-4"
    ],
    "fact" : [
      "Beagle an excellent hunting dog and loyal companion,",
      "The Beagle is a small hound that was originally developed for hunting hare and rabbit by scent, and was followed on foot by hunters. Beagles hunted in packs of 12 or 24 hounds.",
      "The beagle is intelligent and is a popular pet due to its size, good temper, and a lack of inherited health problems.",
      "The National Beagle Club of America says that Beagles are excellent family companions. Their low maintenance cost and their affectionate, yet independent, temperament make them an ideal pet for many families. In recent years, the USDA has 'hired' beagles to work in airports",
      "Beagles are loyal and active dogs that love their owners, Bill Lambert, a spokesperson for The Kennel Club, tells Country Living. They have a long history of popularity in England, not only as hunting dogs, but also as companion dogs – Queen Elizabeth I owned a few too",
    ]
  },
  {
    "id" : "Dobermann",
    "name" : "Dobermann",
    "headline" : "Dobermanns can be calm and loyal dogs given the right training, but they are still very energetic and so suit active households. While they can make great family pets, due to their large size and strong build we wouldn't recommend a Dobermann if you have young children.",
    "description" : "The Dobermann (/ˈdoʊbərmən/; German pronunciation: [ˈdoːbɐman]), or Doberman Pinscher in the U.S. and Canada, is a medium-large breed of domestic dog that was originally developed around 1890 by Louis Dobermann, a tax collector from Germany.The Dobermann has a long muzzle. It stands on its pads and is not usually heavy-footed. Ideally, they have an even and graceful gait. Traditionally, the ears are cropped and posted and the tail is docked. However, in some countries, these procedures are now illegal and it is often considered cruel and unnecessary. Dobermanns have markings on the chest, paws/legs, muzzle, above the eyes, and underneath the tail.Dobermanns are known to be intelligent, alert, and tenaciously loyal companions and guard dogs.Although the breed standards vary among kennel and breed clubs, most follow the standard set by the FCI, which describes the size of male dogs as 68 to 72 centimetres (27 to 28 in) at the withers; The Kennel Club in the UK quotes 69 centimetres (27 in) as being ideal. The size of female dogs, according to the same standards, is 63 to 68 centimetres (25 to 27 in), with 65 centimetres (26 in) being ideal. The Dobermann has a square frame; its length should equal its height to the withers and the length of its head, neck, and legs should be in proportion to its body.The standards for the weight of the Dobermann are also described by the FCI. The ideal dog must be of a sufficient size for an optimal combination of strength, endurance and agility.[6] The ideal weight of male dogs is described as 40–45 kilograms (88–99 lb) and the ideal weight of female dogs is described to be 32–35 kilograms (71–77 lb).Two different color genes exist in the Dobermann: one for black (B) and one for color dilution (D). There are nine possible combinations of these alleles, which can result in four different color phenotypes: black, blue, red, and fawn (Isabella). The traditional and most common color occurs when both the color and dilution genes have at least one dominant allele (i.e., BBDD, BBDd, BbDD or BbDd) and is commonly referred to as black, black and rust, or black and tan. The red, red rust, or brown coloration occurs when the black gene has two recessive alleles but the dilution gene has at least one dominant allele (i.e., bbDD, bbDd). The blue Dobermann has the color gene with at least one dominant allele and the dilution gene with both recessive alleles (i.e., BBdd or Bbdd). The fawn coloration is the least common, occurring only when both the color and dilution genes have two recessive alleles (i.e., bbdd). Thus, the blue color is a diluted black, and the fawn color is a diluted red.Expression of the color dilution gene is a disorder called Color Dilution Alopecia, a kind of canine follicular dysplasia. Although not life-threatening, these dogs can develop skin problems.In 1976, a 'white' Doberman Pinscher was whelped and was subsequently bred to her son, who was also bred to his litter sisters. This tight inbreeding continued for some time to allow the breeders to 'fix' the mutation. This severe inbreeding not only intensified the production of 'white' dogs, it also amplified their health problems. White Dobermans are not recognized within professional breeders and continue to be reproduced by unethical breeders marketing them as rare in order to charge more for an animal that would never win a show competition. The white colored Doberman is prone to suffer long term medical conditions ranging from: poor hearing or complete deafness, poor vision or complete blindness, behavioral/temperament issues, cancers (predominately skin cancer), amongst others. White/Albino Dobermanns are actually a cream color with white markings, blue eyes, and pink nose. Although this is consistent with albinism, the proper characterization of the mutation is currently unknown. The animals are commonly known as tyrosinase-positive albinoids, lacking melanin in oculocutaneous structures.[10] This condition is caused by a partial deletion in the SLC45A2 gene.",
    "link" : "https://en.wikipedia.org/wiki/Dobermann",
    "image" : "gorilla",
    "gallery" : [
      "gorilla-4",
      "gorilla-3",
      "gorilla-2",
      "gorilla-1"
    ],
    "fact" : [
        "The Doberman Pinscher is described as alert, fearless, and loyal and those who love them would certainly agree.",
      "The Doberman pinscher has a long head and a sleek, muscular body. The ears are often cropped to stand erect, and the tail is usually docked short",
      "The Doberman pinscher has a short, sleek and shiny coat that is black, dark red, blue or fawn with rust-colored markings on the face, body and tail.",
      "Dobermans have also become known as loyal, loving family pets. Dobermans (or 'Dobies,' as they're affectionately called by lovers of the breed) are intelligent, active, and adaptable dogs who are happiest when they're with their family units",
      "Dobermans are brave and loyal animals that have been used as war dogs in both World War I and World War II, but they are also more than just that. They have been in service to humankind since the 1500s, when they were used as guard dogs to protect the property of their owners."
      
    ]
  }
]
